{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "anger",
    "1": "annoyance",
    "2": "confusion",
    "3": "disappointment",
    "4": "fear",
    "5": "gratitude",
    "6": "joy",
    "7": "love",
    "8": "neutral",
    "9": "optimism",
    "10": "sadness",
    "11": "surprise"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "anger": 0,
    "annoyance": 1,
    "confusion": 2,
    "disappointment": 3,
    "fear": 4,
    "gratitude": 5,
    "joy": 6,
    "love": 7,
    "neutral": 8,
    "optimism": 9,
    "sadness": 10,
    "surprise": 11
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 0,
  "use_cache": false,
  "vocab_size": 128100
}
